lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/common.cpp
  // func_sel exist
  template <typename T>
  static inline typename std::enable_if<has_func_sel<T>::value, uint32_t>::type
  get_gpio_func_in_sel(T& cfg) { return cfg.func_sel; }

  // func_sel does not exist, func_in_sel exist 
  template <typename T>
  static inline typename std::enable_if<!has_func_sel<T>::value && has_func_in_sel<T>::value, uint32_t>::type
  get_gpio_func_in_sel(T& cfg) { return cfg.func_in_sel; }
  
  // func_sel && func_in_sel does not exist  (use in_sel)
  template <typename T>
  static inline typename std::enable_if<!has_func_sel<T>::value && !has_func_in_sel<T>::value, uint32_t>::type
  get_gpio_func_in_sel(T& cfg) { return cfg.in_sel; }

  static int search_pin_number(int peripheral_sig)
  {
    uint32_t result = get_gpio_func_in_sel(GPIO.func_in_sel_cfg[peripheral_sig]);
    return (result < GPIO_NUM_MAX) ? result : -1;
  }

  uint32_t getApbFrequency(void)
  {
    rtc_cpu_freq_config_t conf;
    rtc_clk_cpu_freq_get_config(&conf);
    if (conf.freq_mhz >= 80){
      return 80 * 1000000;
    }
    #if defined ( CONFIG_IDF_TARGET_ESP32P4 )
      return (conf.source_freq_mhz * 1000000) / conf.div.integer;
    #else
      return (conf.source_freq_mhz * 1000000) / conf.div;
    #endif
  }

  uint32_t getSpiClockFrequency(int spi_host)
  {
#if defined ( CONFIG_IDF_TARGET_ESP32 ) || defined ( CONFIG_IDF_TARGET_ESP32S2 ) \
 || !defined ( CONFIG_IDF_TARGET )
    (void)spi_host;
    return getApbFrequency();
#else
    const auto get_xtal_frequency = []() -> uint32_t
    {
      return static_cast<uint32_t>(rtc_clk_xtal_freq_get()) * 1000000u;
    };
    const auto get_rc_fast_frequency = []() -> uint32_t
    {
#if defined ( LGFX_HAS_ESP_CLK_TREE ) && defined ( SOC_MOD_CLK_RC_FAST )
      uint32_t frequency = 0;
      if (ESP_OK == esp_clk_tree_src_get_freq_hz(SOC_MOD_CLK_RC_FAST
                   , ESP_CLK_TREE_SRC_FREQ_PRECISION_APPROX, &frequency) && frequency)
      {
        return frequency;
      }
#endif
#if defined ( SOC_CLK_RC_FAST_FREQ_APPROX )
      return SOC_CLK_RC_FAST_FREQ_APPROX;
#else
      return 17500000u;
#endif
    };

#if defined ( CONFIG_IDF_TARGET_ESP32S3 ) || defined ( CONFIG_IDF_TARGET_ESP32C2 ) \
 || defined ( CONFIG_IDF_TARGET_ESP32C3 )
    static_assert(SPI_MST_CLK_SEL_V == 1u, "SPI clock source selector must be one bit");
    // SPI_MST_CLK_SEL is a shifted mask in the older SPI register headers;
    // decode with the explicit value mask rather than VALUE_GET_FIELD.
    const uint32_t source_sel = (REG_READ(SPI_CLK_GATE_REG(spi_host + 1))
                               >> SPI_MST_CLK_SEL_S) & SPI_MST_CLK_SEL_V;
    if (source_sel == 0) { return get_xtal_frequency(); }
 #if defined ( CONFIG_IDF_TARGET_ESP32C2 )
    return 40000000u;
 #else
    return 80000000u; // PLL_F80M is independent of CPU/APB frequency scaling.
 #endif

#elif defined ( CONFIG_IDF_TARGET_ESP32C5 ) || defined ( CONFIG_IDF_TARGET_ESP32C61 )
    if (spi_host != SPI2_HOST) { return 160000000u; }
    const uint32_t clkm = REG_READ(PCR_SPI2_CLKM_CONF_REG);
    const uint32_t source_sel = VALUE_GET_FIELD(clkm, PCR_SPI2_CLKM_SEL);
    const uint32_t source_div = VALUE_GET_FIELD(clkm, PCR_SPI2_CLKM_DIV_NUM) + 1u;
    uint32_t source_hz;
    switch (source_sel)
    {
    case 0: source_hz = get_xtal_frequency(); break;
    case 1: source_hz = 160000000u; break;
    case 2: source_hz = get_rc_fast_frequency(); break;
#if defined ( CONFIG_IDF_TARGET_ESP32C5 )
    case 3: source_hz = 120000000u; break;
#endif
    default: source_hz = 160000000u; break; // Safe upper bound for an unknown source.
    }
    return source_hz / source_div;

#elif defined ( CONFIG_IDF_TARGET_ESP32C6 ) || defined ( CONFIG_IDF_TARGET_ESP32H2 )
    if (spi_host != SPI2_HOST)
    {
 #if defined ( CONFIG_IDF_TARGET_ESP32C6 )
      return 80000000u;
 #else
      return 48000000u;
 #endif
    }
    const uint32_t clkm = REG_READ(PCR_SPI2_CLKM_CONF_REG);
    const uint32_t source_sel = VALUE_GET_FIELD(clkm, PCR_SPI2_CLKM_SEL);
    switch (source_sel)
    {
    case 0: return get_xtal_frequency();
 #if defined ( CONFIG_IDF_TARGET_ESP32C6 )
    case 1: return 80000000u;
 #else
    case 1: return 48000000u;
 #endif
    case 2: return get_rc_fast_frequency();
    default:
 #if defined ( CONFIG_IDF_TARGET_ESP32C6 )
      return 80000000u; // Safe upper bound for an unknown source.
 #else
      return 48000000u; // Safe upper bound for an unknown source.
 #endif
    }

#elif defined ( CONFIG_IDF_TARGET_ESP32P4 )
    const uint32_t ctrl116 = REG_READ(HP_SYS_CLKRST_PERI_CLK_CTRL116_REG);
    uint32_t source_sel;
    uint32_t hs_div;
    uint32_t mst_div;
    if (spi_host == SPI2_HOST)
    {
      source_sel = VALUE_GET_FIELD(ctrl116, HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL);
      hs_div = VALUE_GET_FIELD(ctrl116, HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM);
      mst_div = VALUE_GET_FIELD(ctrl116, HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM);
    }
    else if (spi_host == SPI3_HOST)
    {
      const uint32_t ctrl117 = REG_READ(HP_SYS_CLKRST_PERI_CLK_CTRL117_REG);
      source_sel = VALUE_GET_FIELD(ctrl116, HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL);
      hs_div = VALUE_GET_FIELD(ctrl117, HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_DIV_NUM);
      mst_div = VALUE_GET_FIELD(ctrl117, HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_DIV_NUM);
    }
    else
    {
      return getApbFrequency();
    }

    uint32_t source_hz;
    switch (source_sel)
    {
    case 0: source_hz = get_xtal_frequency(); break;
    case 1: source_hz = get_rc_fast_frequency(); break;
    case 4: source_hz = 480000000u; break; // SPLL
    default: source_hz = 480000000u; break; // Safe upper bound for an unknown source.
    }
    return source_hz / (hs_div + 1) / (mst_div + 1);
#else
    (void)spi_host;
    return getApbFrequency();
#endif
#endif
  }

  uint32_t FreqToClockDiv(uint32_t fapb, uint32_t hz)
  {
    if (fapb <= hz) return SPI_CLK_EQU_SYSCLK;
    uint32_t div_num = fapb / (1 + hz);
    uint32_t pre = std::min<uint32_t>(div_num / (SPI_CLKCNT_N_V + 1u), SPI_CLKDIV_PRE_V);
    div_num = std::min<uint32_t>(div_num / (pre+1), SPI_CLKCNT_N_V);
    return div_num << 12 | ((div_num-1)>>1) << 6 | div_num | pre << 18;
  }

  void calcClockDiv(uint32_t* div_a, uint32_t* div_b, uint32_t* div_n, uint32_t* clkcnt, uint32_t baseClock, uint32_t targetFreq)
  {
    uint32_t diff = INT32_MAX;
    *div_n = 256;
    *div_a = 63;
    *div_b = 62;
    *clkcnt = 64;
    uint32_t start_cnt = std::min<uint32_t>(64u, (baseClock / (targetFreq * 2) + 1));
    uint32_t end_cnt = std::max<uint32_t>(2u, baseClock / 256u / targetFreq);
    if (start_cnt <= 2) { end_cnt = 1; }
    for (uint32_t cnt = start_cnt; diff && cnt >= end_cnt; --cnt)
    {
      float fdiv = (float)baseClock / cnt / targetFreq;
      uint32_t n = std::max<uint32_t>(2u, (uint32_t)fdiv);
      fdiv -= n;

      for (uint32_t a = 63; diff && a > 0; --a)
      {
        uint32_t b = roundf(fdiv * a);
        if (a == b && n == 256) {
          break;
        }
        uint32_t freq = baseClock / ((n * cnt) + (float)(b * cnt) / (float)a);
        uint32_t d = abs((int)targetFreq - (int)freq);
        if (diff <= d) { continue; }
        diff = d;
        *clkcnt = cnt;
        *div_n = n;
        *div_b = b;
        *div_a = a;
        if (b == 0 || a == b) {
          break;
        }
      }
    }
    if (*div_a == *div_b)
    {
        *div_b = 0;
        *div_n += 1;
    }
  }

  uint32_t get_pkg_ver(void)
  {
#if defined ( USE_ESP_EFUSE_GET_PKG_VER )
    return esp_efuse_get_pkg_ver();
#else
    uint32_t pkg_ver = REG_GET_FIELD(EFUSE_BLK0_RDATA3_REG, EFUSE_RD_CHIP_VER_PKG);
    if (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32PICOD4)
    {
      if (REG_READ(APB_CTRL_DATE_REG) & 0x80000000)
      { // ESP32PICOV302
        return 6;
      }
    }
    return pkg_ver;
#endif
  }

  int32_t search_dma_out_ch(int peripheral_select)
  {
#if defined ( SOC_GDMA_SUPPORTED ) && defined ( DMA_OUT_PERI_SEL_CH0_REG )
    // ESP32C3: SPI2==0
    // ESP32S3: SPI2==0 / SPI3==1
    // SOC_GDMA_TRIG_PERIPH_SPI3
    // SOC_GDMA_TRIG_PERIPH_LCD0
    // GDMAペリフェラルレジスタの配列を順に調べてペリフェラル番号が一致するDMAチャンネルを特定する;
    for (int i = 0; i < SOC_GDMA_PAIRS_PER_GROUP_MAX; ++i)
    {
#if defined AXI_DMA_OUT_PERI_SEL_CH0_REG
      bool hit = (*reg(DMA_OUT_PERI_SEL_CH0_REG + i * sizeof(AXI_DMA.out[0])) & AXI_DMA_PERI_OUT_SEL_CH0_M) == peripheral_select;
#else
   // ESP_LOGD("DBG","GDMA.channel:%d peri_sel:%d", i, GDMA.channel[i].out.peri_sel.sel);
      bool hit = (*reg(DMA_OUT_PERI_SEL_CH0_REG + i * SIZE_OF_DMA_CH) & DMA_PERI_OUT_SEL_CH0_M) == peripheral_select;
#endif
      if (hit)
      {
// ESP_LOGD("DBG","GDMA.channel:%d hit", i);
        return i;
      }
    }
#endif
    return -1;
  }

  int32_t search_dma_in_ch(int peripheral_select)
  {
#if defined ( SOC_GDMA_SUPPORTED ) && defined ( DMA_IN_PERI_SEL_CH0_REG )
    // ESP32C3: SPI2==0
    // ESP32S3: SPI2==0 / SPI3==1
    // SOC_GDMA_TRIG_PERIPH_SPI3
    // SOC_GDMA_TRIG_PERIPH_LCD0
    // GDMAペリフェラルレジスタの配列を順に調べてペリフェラル番号が一致するDMAチャンネルを特定する;
    for (int i = 0; i < SOC_GDMA_PAIRS_PER_GROUP_MAX; ++i)
    {
#if defined AXI_DMA_OUT_PERI_SEL_CH0_REG
      bool hit = (*reg(DMA_IN_PERI_SEL_CH0_REG + i * sizeof(AXI_DMA.in[0])) & AXI_DMA_PERI_IN_SEL_CH0_M) == peripheral_select;
#else
   // ESP_LOGD("DBG","GDMA.channel:%d peri_sel:%d", i, GDMA.channel[i].out.peri_sel.sel);
      bool hit = (*reg(DMA_IN_PERI_SEL_CH0_REG + i * SIZE_OF_DMA_CH) & DMA_PERI_IN_SEL_CH0_M) == peripheral_select;
#endif
      if (hit)
      {
// ESP_LOGD("DBG","GDMA.channel:%d hit", i);
        return i;
      }
    }
#endif
    return -1;
  }

  void debug_memory_dump(const void* src, size_t len)
  {
    auto s = (const uint32_t*)src;
    do
    {
      printf("0x%08x = 0x%08x\n", (int)s, (int)s[0]);
      ++s;
      len -= 4;
    } while (len > 0);
  }

//----------------------------------------------------------------------------

