lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/common.cpp
    cpp::result<void, error_t> release(int i2c_port)
    {
      if (isSoftPort(i2c_port)) { return soft_i2c_release(i2c_port); }
      if (i2c_port >= LGFX_I2C_PORT_NUM) { return cpp::fail(error_t::invalid_arg); }
      if (i2c_context[i2c_port].initialized)
      {
        i2c_context[i2c_port].initialized = false;
#if LGFX_LP_I2C_NUM > 0
        if (isLpPort(i2c_port))
        { // Opened through the ESP-IDF driver in init(), so it is closed the same way.
          auto bus_handle = i2c_context[i2c_port].i2c_bus_handle;
          if (bus_handle) {
            i2c_context[i2c_port].i2c_bus_handle = nullptr;
            i2c_del_master_bus(bus_handle);
          }
 #if SOC_RTCIO_PIN_COUNT > 0
          // The pins have to be handed back explicitly: their routing lives in the low
          // power domain and would otherwise outlive this program, leaving them unusable
          // from a normal port even after a reset. ( see releaseLpPad )
          releaseLpPad(i2c_context[i2c_port].pin_sda);
          releaseLpPad(i2c_context[i2c_port].pin_scl);
 #endif
        }
        else
#endif
        {
#if defined ( ARDUINO ) && __has_include (<Wire.h>) && defined ( ESP_IDF_VERSION_VAL )
 #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  #if defined ARDUINO_ESP32_GIT_VER
    #if ARDUINO_ESP32_GIT_VER != 0x44c11981
      #if LGFX_HP_I2C_NUM == 1
        auto twowire = &Wire;
      #else
        auto twowire = ((i2c_port == 0) ? &Wire : &Wire1);
      #endif
        twowire->end();
    #endif
  #endif
 #endif
#elif __has_include(<driver/i2c_master.h>)
        auto bus_handle = i2c_context[i2c_port].i2c_bus_handle;
        if (bus_handle) {
          i2c_context[i2c_port].i2c_bus_handle = nullptr;
          i2c_del_master_bus(bus_handle);
        }
#else
        i2c_periph_disable(i2c_port);
#endif
        }
        if ((int)i2c_context[i2c_port].pin_scl >= 0)
        {
          pinMode(i2c_context[i2c_port].pin_scl, pin_mode_t::input_pullup);
        }
        if ((int)i2c_context[i2c_port].pin_sda >= 0)
        {
          pinMode(i2c_context[i2c_port].pin_sda, pin_mode_t::input_pullup);
        }
      }

      return {};
    }

    cpp::result<void, error_t> setPins(int i2c_port, int pin_sda, int pin_scl)
    {
      if (((uint32_t)pin_scl >= GPIO_NUM_MAX)
       || ((uint32_t)pin_sda >= GPIO_NUM_MAX))
      {
        return cpp::fail(error_t::invalid_arg);
      }
      if (isSoftPort(i2c_port)) { return soft_i2c_setPins(i2c_port, pin_sda, pin_scl); }
      if (i2c_port >= LGFX_I2C_PORT_NUM) { return cpp::fail(error_t::invalid_arg); }

      if (i2c_context[i2c_port].initialized
       && i2c_context[i2c_port].pin_scl == (gpio_num_t)pin_scl
       && i2c_context[i2c_port].pin_sda == (gpio_num_t)pin_sda
      )
      {
        return {};
      }

      release(i2c_port).has_value();
      i2c_context[i2c_port].pin_scl = (gpio_num_t)pin_scl;
      i2c_context[i2c_port].pin_sda = (gpio_num_t)pin_sda;
#if LGFX_LP_I2C_NUM > 0
      // The TwoWire instances belong to the normal ports; a low power port has none,
      // and handing these pins to one would redirect that port to them.
      if (isLpPort(i2c_port)) { return {}; }
#endif
#if defined ( ARDUINO ) && __has_include (<Wire.h>)
 #if defined ( ESP_IDF_VERSION_VAL )
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(3, 3, 0)
   #define USE_TWOWIRE_SETPINS
  #endif
 #endif
 #if defined ( USE_TWOWIRE_SETPINS )

#if LGFX_HP_I2C_NUM == 1
      auto twowire = &Wire;
#else
      auto twowire = ((i2c_port == 0) ? &Wire : &Wire1);
#endif
      twowire->setPins(pin_sda, pin_scl);
 #endif
#endif
      return {};
    }

    cpp::result<int, error_t> getPinSDA(int i2c_port)
    {
      if (isSoftPort(i2c_port)) { return soft_i2c_getPinSDA(i2c_port); }
      if (i2c_port >= LGFX_I2C_PORT_NUM) { return cpp::fail(error_t::invalid_arg); }
      return i2c_context[i2c_port].pin_sda;
    }

    cpp::result<int, error_t> getPinSCL(int i2c_port)
    {
      if (isSoftPort(i2c_port)) { return soft_i2c_getPinSCL(i2c_port); }
      if (i2c_port >= LGFX_I2C_PORT_NUM) { return cpp::fail(error_t::invalid_arg); }
      return i2c_context[i2c_port].pin_scl;
    }

    cpp::result<void, error_t> init(int i2c_port)
    {
      if (isSoftPort(i2c_port))
      {
#if LGFX_LP_I2C_NUM > 0 && SOC_RTCIO_PIN_COUNT > 0
        if (soft_i2c_valid_port(i2c_port))
        { // 低電力ポートのルーティングはリセットを跨いで残るため、前回実行が
          // LP ポートとして使ったピンをソフトポートで取り直す場合にも返却が
          // 必要になる。( see releaseLpPad )
          auto& ctx = soft_i2c_ctx(i2c_port);
          releaseLpPad((gpio_num_t)ctx.pin_sda);
          releaseLpPad((gpio_num_t)ctx.pin_scl);
        }
#endif
        return soft_i2c_init(i2c_port);
      }
      if (i2c_port >= LGFX_I2C_PORT_NUM) { return cpp::fail(error_t::invalid_arg); }
      gpio_num_t pin_sda = i2c_context[i2c_port].pin_sda;
      gpio_num_t pin_scl = i2c_context[i2c_port].pin_scl;
      if (((uint32_t)pin_scl >= GPIO_NUM_MAX)
       || ((uint32_t)pin_sda >= GPIO_NUM_MAX))
      {
        return cpp::fail(error_t::invalid_arg);
      }

      if (i2c_context[i2c_port].initialized)
      {
        release(i2c_port);
      }

      i2c_stop(i2c_port);

#if LGFX_LP_I2C_NUM > 0
      if (isLpPort(i2c_port))
      {
        i2c_master_bus_config_t bus_config;
        memset(&bus_config, 0, sizeof(i2c_master_bus_config_t));
        bus_config.i2c_port = i2c_port;
        bus_config.sda_io_num = pin_sda;
        bus_config.scl_io_num = pin_scl;
        bus_config.lp_source_clk = LGFX_LP_I2C_SCLK;
        bus_config.glitch_ignore_cnt = 7;
        bus_config.flags.enable_internal_pullup = true;
        bus_config.intr_priority = 1;

        i2c_master_bus_handle_t bus_handle = nullptr;
        if (ESP_OK != i2c_new_master_bus(&bus_config, &bus_handle))
        { // The pins of the low power port are constrained: they have to be LP IO, and on
          // the chips without an LP GPIO matrix they are a fixed pair.
          return cpp::fail(error_t::invalid_arg);
        }
        i2c_context[i2c_port].i2c_bus_handle = bus_handle;
        i2c_context[i2c_port].initialized = true;

        // The pads are already routed to the peripheral by the call above, and they do not
        // go through the normal GPIO matrix that set_pin() drives, so it is not called.
        i2c_context[i2c_port].save_reg(getDev(i2c_port));
        return {};
      }
#endif

